Tekla Open API Reference for Tekla Structures 2025
AnalysisSupport.Support Property
 The connectivity type of the connectivity.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisSupport.SupportEnum[] Support { get; set; }
Public Property Support As AnalysisSupport.SupportEnum()
	Get
	Set
Property Value
Type: AnalysisSupport.SupportEnum[]
See Also
Reference
AnalysisSupport Class
Tekla.Structures.Analysis Namespace